Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalModelIsIncorrect Property
 Analytical Model is not created for the structural element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalModelIsIncorrect { get; }
Public Shared ReadOnly Property AnalyticalModelIsIncorrect As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalModelIsIncorrect {
	FailureDefinitionId^ get ();
}
static member AnalyticalModelIsIncorrect : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace